---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CwpCopyRoofInserts
source: html/f320b5b6-946d-7b09-feba-186e7d71d247.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CwpCopyRoofInserts Property

"Copy openings"

## Syntax (C#)
```csharp
public static ForgeTypeId CwpCopyRoofInserts { get; }
```